
questions = [
    "Який в мене колір очей",
    "Яка дівчина мені пасує",
    "Який мий любимий футбольний клуб",
    "Що мені не хотіли продавати в спарі",
    "Де я люблю цілуватися з дівчи",
    "Де я живу",
    "З відки я",
    "Яких я дівчат не переношу надух",
    "Де в мене є шрам який лишиться на ве",
    "Де в мене романтичне місце",
    "Які я люблю слухати пісні",
    "Як мою першу дівчину звали",
    "Дівчати шо при першій зустрічі зі мною виб",
    "Який удар я люблю бити",
    "Де в мене був перший..."


]


answers = {
    "Який в мене колір очей":{
        'голубі': 1,
        'сірі': 2,
        'морської хвилі': 3,
        'карі': 10,
    },

    "Яка дівчина мені пасує":{
        'добра позитивна': 10 ,
        'безбашена': 3,
        'сексі': 5,
        'всяка': -3,
    },

    "Який мий любимий футбольний клуб":{

        'Динамо':4,
        'ПСЖ': 3,
        'Реал': 10,
        'Барселона': -4,

    },


    "Що мені не хотіли продавати в спарі":{
        'горівку': 5,
        'сигарети, казали мені що нема 18+':10,
        'пиво':7,
        'рево': 5,

    },

    "Де я люблю цілуватися з дівчи":{
        'на природі':5,
        'біля ріки':10,
        'в горах':3,
        'буть де':0,
    },

    "Де я живу":{
        'біля ріки':3,
        'біля озера':-4,
        'біля горів':0,
        'біля лугу':10,
    },

    "З відки я":{
        'рожнятів':3,
        'сваричів':10,
        'тужилів':0,
        'брошнів':2,
    },

    "Яких я дівчат не переношу надух":{
        'йобнутих':4,
        'злих':0,
        'ставлять хуй знає що з себе':10,
        'крутих':-5,
    },

    "Де в мене є шрам який лишиться на ве":{
        'на плечі':0,
        'на руках':-5,
        'на коліні від коси':10,
        'на голові':-10,

    },

    "Де в мене романтичне місце":{
        'в лузі':4,
        'біля річки':10,
        'біля вогню':5,
        'біля водоспаду':0,

    },

    "Які я люблю слухати пісні":{
        'українські':10,
        'зарубіжні':3,
        'рок':0,
        'різні':-5,
    },

    "Як мою першу дівчину звали": {
        "Мар'яна":-10,
        'Марія':10,
        'Христя':5,
        'Юля':-10,
},

    "Дівчати шо при першій зустрічі зі мною виб": {
        'попит нормально':10,
        'цілуватися':-5,
        'нахуй ти мені потрібен':-10000,
        'зразу секс':3,
},

    "Який удар я люблю бити":{
    'в щелепу і нокаут':3,
    'в печень і піздець':10,
    'в голову і торба': 0,
    'всюди':-5,
},

    "Де в мене був перший...": {
        'біля річки':3,
        'заду клуба':10,
        'в хаті':0,
        'під лавков':-10,
},

    # ... (other answers)
}